http2/src/test/resources/jmeter/testJMeter.yaml
services:
- module: shellexec
  startup:
  - PWD = pwd
  - echo $PWD
  - chmod +x $JMETER_TEST_PATH/mod-script.sh && $JMETER_TEST_PATH/mod-script.sh

modules:
  jmeter:
    path: .jmeter/4.0
    version: "4.0"
    properties:
      log_level: DEBUG
  console:
    disable: true

execution:
- concurrency: 2
  scenario: http2
  iterations : 2
  
scenarios:
  http2:
    script: HTTP2SamplerTest.jmx

reporting:
- module: passfail
  criteria:
  - failures>0%